In [59]:
import psycopg2 as ps
import pandas as pd

In [16]:
conn = ps.connect(
    host = "localhost",
    port = 5432,
    dbname = "hacktiv8",
    user = "postgres",
    password = "postgres"
)

conn

In [17]:
cursor = conn.cursor()

In [5]:
cursor.execute(query='''
    CREATE TABLE IF NOT EXISTS "Customers" (
        "customer_id" serial PRIMARY KEY,
        "customer_name" text,
        "city" text
    );
''')

In [22]:
cursor.execute(query='''
    CREATE TABLE IF NOT EXISTS "Orders" (
        "order_id" serial PRIMARY KEY,
        "customer_id" int,
        "customer_name" text,
        "oder_date" date,
        "total_amount" int,
        FOREIGN KEY (customer_id) 
            REFERENCES "Customers"(customer_id)
    );
''')

In [24]:
cursor.execute(query='''
    INSERT INTO "Customers" (customer_name, city)
    VALUES ('John Doe', 'New York'),
            ('Jane Smith', 'Los Angeles'),
            ('David Johnson', 'Chicago');
''')

In [32]:
cursor.execute(query='''
    INSERT INTO "Orders" (customer_id, order_date, total_amount)
    VALUES ('1', '2022-01-10', 100),
            ('1', '2022-02-15', 150),
            ('2', '2022-03-20', 200),
            ('3', '2022-04-25', 50);
''')

In [63]:
cursor.execute(query='''
    SELECT "Customers".customer_name, COUNT("Orders".order_date)
    FROM "Customers"
    JOIN "Orders" ON "Customers".customer_id = "Orders".customer_id
    GROUP BY "Customers".customer_name;
''')

In [64]:
result = cursor.fetchall()
df = pd.DataFrame(result, columns=["Customer Name", "Order Count"])
df

   Customer Name  Order Count
0       John Doe            2
1  David Johnson            1
2     Jane Smith            1

In [54]:
conn.commit()

In [65]:
if cursor:
        cursor.close()
if conn:
    conn.close()